{
  "experience": [
    {
      "id": "element_pst_2024",
      "company": "ELEMENT-SOFT",
      "period": {
        "from": "2024-12-15",
        "to": "2025-08-15"
      },
      "project": {
        "name": {
          "ru": "Система мониторинга персонала и техники на опасных производственных объектах",
          "en": "Workforce and Equipment Monitoring System for Hazardous Sites"
        },
        "architecture": "Microservices"
      },
      "team": {
        "backend": 2,
        "frontend": 2,
        "qa": 2
      },
      "technologies": [
        "Java 17/21",
        "Spring",
        "Gradle",
        "PostgreSQL",
        "Apache Kafka",
        "Flyway",
        "GitLab",
        "Swagger",
        "Postman",
        "PostGIS",
        "GeoServer"
      ],
      "content": {
        "hr": {
          "ru": {
            "summary": "Поддержка и стабилизация системы мониторинга персонала и техники на опасных производственных объектах после миграции с монолитной архитектуры на микросервисы. Система используется для контроля безопасных и запретных зон, а также оперативного реагирования на нарушения.",
            "responsibilities": [
              "Поддержка production-системы в условиях нестабильной микросервисной архитектуры",
              "Устранение критических ошибок, возникших после миграции с монолита",
              "Повышение надёжности и предсказуемости работы системы",
              "Работа с сервисами обработки геоданных и событий мониторинга",
              "Взаимодействие с командой для оперативного решения инцидентов"
            ]
          },
          "en": {
            "summary": "Maintained and stabilized a workforce and equipment monitoring system for hazardous industrial sites after migration from a monolithic architecture to microservices. The system is used to control restricted zones and ensure operational safety.",
            "responsibilities": [
              "Supported a production system with an unstable microservice architecture",
              "Resolved critical issues caused by monolith-to-microservices migration",
              "Improved system reliability and operational stability",
              "Worked with services processing geospatial data and monitoring events",
              "Collaborated with the team to handle production incidents"
            ]
          }
        },
        "cto": {
          "ru": {
            "responsibilities": [
              "Участие в стабилизации микросервисной архитектуры после неполной миграции с монолита",
              "Анализ и устранение проблем высокой связности между сервисами",
              "Работа с Kafka и асинхронным взаимодействием сервисов",
              "Поддержка и развитие REST API в распределённой системе",
              "Эксплуатация геоинформационных компонентов (PostGIS, GeoServer)"
            ]
          },
          "en": {
            "responsibilities": [
              "Participated in stabilizing a microservice architecture after an incomplete monolith migration",
              "Analyzed and resolved issues caused by excessive coupling between services",
              "Worked with Kafka and asynchronous inter-service communication",
              "Maintained and evolved REST APIs in a distributed system",
              "Operated geospatial components (PostGIS, GeoServer)"
            ]
          }
        }
      }
    },
    {
      "id": "element_lokro_2023",
      "company": "ELEMENT-SOFT",
      "period": {
        "from": "2023-11-09",
        "to": "2024-12-15"
      },
      "project": {
        "name": {
          "ru": "Система мониторинга и аудита промышленных измерений",
          "en": "Industrial Measurement Monitoring and Audit Platform"
        },
        "architecture": "Monolith"
      },
      "team": {
        "backend": 5,
        "frontend": 2,
        "qa": 2
      },
      "technologies": [
        "Java 17",
        "Spring 3.2.4",
        "Gradle",
        "PostgreSQL 15.2",
        "Docker",
        "Flyway",
        "GitLab",
        "Swagger",
        "Postman",
        "Apache POI",
        "MinIO (S3)"
      ],
      "content": {
        "hr": {
          "ru": {
            "summary": "Backend-разработка системы учёта радиационных измерений для закрытого контура АЭС. Проект был унаследован без документации и онбординга после ухода предыдущей команды. Backend-команда самостоятельно формализовывала требования, оценивала задачи и реализовывала функциональность. В процессе проект был полностью переписан в связи с расширением и изменением требований.",
            "responsibilities": [
              "Реализация backend-логики на всех слоях (DTO, entities, repositories, services, REST)",
              "PostgreSQL + Flyway для управления схемой базы данных",
              "MinIO (S3) для хранения планов помещений и панорамных изображений",
              "PostGIS для пространственных данных и позиционирования измерений",
              "Spring AOP — реализация унифицированного модуля аудита операций",
              "Монолитная архитектура"
            ]
          },
          "en": {
            "summary": "Backend development of a radiation measurement tracking system for a nuclear power plant operating in a closed network environment. The project was inherited without documentation or onboarding after the previous team had left. The backend team independently formalized requirements, estimated tasks, and implemented functionality. Over time, the system was completely rewritten due to significant expansion and changes in requirements.",
            "responsibilities": [
              "Implemented backend logic across all layers (DTOs, entities, repositories, services, REST APIs)",
              "PostgreSQL with Flyway for database schema versioning and migrations",
              "MinIO (S3-compatible storage) for floor plans and panoramic images",
              "PostGIS for spatial data and positioning of measurements",
              "Spring AOP — implementation of a unified audit logging module",
              "Monolithic architecture"
            ]
          }
        },
        "cto": {
          "ru": {
            "responsibilities": [
              "Работа с унаследованным монолитным кодом без документации",
              "Полный рефакторинг и переписывание системы под изменившиеся требования",
              "Реализация сквозного аудита операций с использованием Spring AOP",
              "Работа с пространственными данными (PostGIS) и объектным хранилищем (MinIO)",
              "Проектирование REST API и бизнес-логики на Spring Framework"
            ]
          },
          "en": {
            "responsibilities": [
              "Worked with a legacy monolithic codebase without documentation",
              "Performed a full refactor and rewrite of the system to meet evolving requirements",
              "Implemented cross-cutting audit logging using Spring AOP",
              "Worked with spatial data (PostGIS) and object storage (MinIO)",
              "Designed REST APIs and core business logic using the Spring Framework"
            ]
          }
        }
      }
    },
    {
      "id": "project_city_drive_booster_2024",
      "company": "PERSONAL PROJECT",
      "period": {
        "from": "2022-10-01",
        "to": "2023-10-20"
      },
      "project": {
        "name": {
          "ru": "Система автоматизации заданий для каршеринговых перегонщиков",
          "en": "Task Automation System for Carsharing Vehicle Relocation"
        },
        "architecture": "Backend service + Telegram Bot"
      },
      "team": {
        "backend": 1,
        "qa": 2
      },
      "technologies": [
        "Java 21",
        "Spring Boot 3",
        "Gradle",
        "PostgreSQL",
        "PostGIS",
        "Spring Data JPA (Hibernate)",
        "Flyway",
        "Apache HttpClient",
        "Jackson",
        "Telegram Bot API",
        "S2 Geometry Library",
        "MapStruct",
        "Lombok"
      ],
      "content": {
        "hr": {
          "ru": {
            "summary": "Личный проект по автоматизации работы перегонщиков каршеринга. Система снижала необходимость постоянного взаимодействия со смартфоном за рулём, автоматически подбирая и принимая задания по заданным параметрам и уведомляя пользователя через Telegram-бота.",
            "responsibilities": [
              "Разработка backend-сервиса для автоматической обработки и принятия заданий",
              "Реализация Telegram-бота как основного пользовательского интерфейса",
              "Автоматизация подбора заданий по типу, зоне и радиусу",
              "Снижение отвлечений водителей от управления транспортным средством",
              "Оптимизация частоты запросов для снижения нагрузки на внешнюю систему"
            ]
          },
          "en": {
            "summary": "A personal project focused on automating task management for carsharing vehicle relocation drivers. The system reduced the need for frequent smartphone interaction while driving by automatically selecting and accepting tasks and notifying users via a Telegram bot.",
            "responsibilities": [
              "Developed a backend service for automated task processing and acceptance",
              "Implemented a Telegram bot as the primary user interface",
              "Automated task selection based on type, zone, and radius",
              "Reduced driver distraction during vehicle operation",
              "Optimized request frequency to minimize load on external systems"
            ]
          }
        },
        "cto": {
          "ru": {
            "responsibilities": [
              "Проектирование backend-сервиса для автоматизации высокочастотных запросов",
              "Реализация адаптивного polling-механизма с учётом ограничений внешнего API",
              "Изоляция пользовательских сессий через индивидуальные прокси",
              "Работа с геопозиционированием и радиусным поиском задач",
              "Реализация распределённой логики назначения заданий между пользователями",
              "Разработка stateful Telegram-бота с асинхронной обработкой событий"
            ]
          },
          "en": {
            "responsibilities": [
              "Designed a backend service for automating high-frequency task polling",
              "Implemented adaptive polling mechanisms considering external API limits",
              "Isolated user sessions using per-user proxy configurations",
              "Worked extensively with geolocation and radius-based task matching",
              "Implemented distributed task assignment logic between users",
              "Developed a stateful Telegram bot with asynchronous event handling"
            ]
          }
        }
      }
    },
    {
      "id": "personal_pos_coffee_app",
      "company": "PERSONAL PROJECT",
      "period": {
        "from": "2022-01-15",
        "to": "2022-10-01"
      },
      "project": {
        "name": {
          "ru": "POS-система для сети кофеен",
          "en": "POS System for a Coffee Shop Chain"
        },
        "architecture": "Desktop application"
      },
      "team": {
        "backend": 1,
        "frontend": 1
      },
      "technologies": [
        "Java 17",
        "Hibernate",
        "MySQL",
        "SQLite",
        "JavaFX",
        "JDBC"
      ],
      "content": {
        "hr": {
          "ru": {
            "summary": "Персональный desktop-проект, разработанный для владельца сети кофеен в Санкт-Петербурге.",
            "responsibilities": [
              "Разработал POS-систему для бариста с нуля",
              "Реализовал учёт товарных остатков и процесс продаж",
              "Внедрил систему в нескольких кофейнях и занимался поддержкой",
              "Обеспечил работу приложения при отсутствии интернет-соединения"
            ]
          },
          "en": {
            "summary": "A personal desktop POS system developed for a coffee shop chain owner in Saint Petersburg.",
            "responsibilities": [
              "Developed a POS system for baristas from scratch",
              "Implemented inventory management and sales processing",
              "Deployed the system in multiple coffee shops and provided ongoing support",
              "Ensured offline operation when internet connection was unavailable"
            ]
          }
        },
        "cto": {
          "ru": {
            "responsibilities": [
              "Спроектировал desktop-приложение на Java без использования Spring",
              "Реализовал offline-first подход с использованием SQLite",
              "Настроил синхронизацию локальных данных продаж с центральной MySQL БД",
              "Разработал UI на JavaFX",
              "Самостоятельно принимал архитектурные и технологические решения"
            ]
          },
          "en": {
            "responsibilities": [
              "Designed a Java desktop application without Spring framework",
              "Implemented an offline-first approach using SQLite",
              "Built data synchronization between local SQLite and central MySQL database",
              "Developed UI using JavaFX",
              "Independently made architectural and technology decisions"
            ]
          }
        }
      }
    }
  ]
}
